src/Documents/ДоплатаБГС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ДоплатаБГС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЕСНИсчисленный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаботникиОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Физлицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОбл</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБГС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доплата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаботникиОрганизацииФизЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Физлицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОбл</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБГСНачисленная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБГСРасчетная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доплата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоплатаНачисленная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоплатаКНачислению</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CalculationRegisters/ДополнительныеНачисленияРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<CalculationRegister>
		<Properties>
			<Name>ДополнительныеНачисленияРаботниковОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<Periodicity>Day</Periodicity>
			<ActionPeriod>false</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ДополнительныеНачисленияОрганизаций</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплаченоДнейЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкидкаПриНалогообложении</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Показатель1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРасчетаСреднегоЗаработкаНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРасчетаСреднегоЗаработкаОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаСобытия</Name>
					<Comment>Дата начала события, оплачиваемого по среднему заработку</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Авторасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДоговорНаВыполнениеРаботСФизЛицом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчетаВремени</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СторнируемыйДокумент</Name>
					<Comment>Документ, который зарегистрировал сторнируемое начисление</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Сторнирование</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЕдиновременныхПособийЗаСчетФСС</v8:Type>
						<v8:Type>cfg:DocumentRef.НевыходыВОрганизациях</v8:Type>
						<v8:Type>cfg:DocumentRef.ТабельУчетаРабочегоВремениОрганизации</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистрацияПростоевРаботниковОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеДивидендовОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеОтпускаРаботникамОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПоБольничномуЛисту</v8:Type>
						<v8:Type>cfg:DocumentRef.ПремииРаботниковОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплатыРаботникамОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистрацияРазовыхНачисленийРаботниковОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.РасчетПриУвольненииРаботникаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойРасчетСреднегоЗаработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерСреднегоЗаработка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ауМестоРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СЭ_МестаРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

src/InformationRegisters/РазмерыПараметровДляРасчетаРБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РазмерыПараметровДляРасчетаРБ</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидПараметра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПараметровДляРасчетаЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/ДоплатаБГС/Ext/ObjectModule.bsl
Процедура Автозаполнение() Экспорт 
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос1 = Новый Запрос;
	Запрос1.Текст = 
	"ВЫБРАТЬ
	|	ОснДопНач.Сотрудник,
	|	ОснДопНач.ФизЛицо,
	|	ОснДопНач.ПериодДействия КАК ПериодВзаиморасчетов,
	|	ОснДопНач.Результат КАК СуммаОбл,
	|	ОснДопНач.Результат * ВЫБОР
	|		КОГДА ОснДопНач.Сотрудник = ИноеНалогообложениеПоСотрудникамСрезПоследних.Сотрудник
	|			ТОГДА ИноеНалогообложениеПоСотрудникамСрезПоследних.БГС
	|		ИНАЧЕ СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевСрезПоследних.Ставка
	|	КОНЕЦ / 100 КАК СуммаБГС,
	|	ЕСНИсчисленныйРег.Доплата КАК ДоплатаНачисленная
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Сотрудник КАК Сотрудник,
	|		ВложенныйЗапрос.ФизЛицо КАК ФизЛицо,
	|		НачалоПериода(ВложенныйЗапрос.ПериодДействия,Месяц) КАК ПериодДействия, //О.Т. 11.06.2015 № 
	|		СУММА(ВложенныйЗапрос.Результат) КАК Результат
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ОсновныеНачисленияРаботниковОрганизаций.Сотрудник КАК Сотрудник,
	|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
	|			ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия КАК ПериодДействия,
	|			СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат
	|		ИЗ
	|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					ВложенныйЗапрос.ФизЛицо КАК ФизЛицо,
	|					КОЛИЧЕСТВО(ВложенныйЗапрос.Сотрудник) КАК Сотрудник
	|				ИЗ
	|					(ВЫБРАТЬ
	|						ВложенныйЗапрос.ФизЛицо КАК ФизЛицо,
	|						ВложенныйЗапрос.Сотрудник КАК Сотрудник
	|					ИЗ
	|						(ВЫБРАТЬ
	|							ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
	|							ОсновныеНачисленияРаботниковОрганизаций.Сотрудник КАК Сотрудник
	|						ИЗ
	|							РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	|						ГДЕ
	|							ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &ПериодНачало И &ПериодКонец
	|							И ОсновныеНачисленияРаботниковОрганизаций.Организация = &Организация
	|						
	|						СГРУППИРОВАТЬ ПО
	|							ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо,
	|							ОсновныеНачисленияРаботниковОрганизаций.Сотрудник
	|						
	|						ОБЪЕДИНИТЬ ВСЕ
	|						
	|						ВЫБРАТЬ
	|							ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
	|							ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник
	|						ИЗ
	|							РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
	|						ГДЕ
	|							ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало МЕЖДУ &ПериодНачало И &ПериодКонец
	|							И ДополнительныеНачисленияРаботниковОрганизаций.Организация = &Организация
	|						
	|						СГРУППИРОВАТЬ ПО
	|							ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
	|							ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник) КАК ВложенныйЗапрос
	|					
	|					СГРУППИРОВАТЬ ПО
	|						ВложенныйЗапрос.ФизЛицо,
	|						ВложенныйЗапрос.Сотрудник) КАК ВложенныйЗапрос
	|				
	|				СГРУППИРОВАТЬ ПО
	|					ВложенныйЗапрос.ФизЛицо) КАК ВложенныйЗапрос
	|				ПО ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо = ВложенныйЗапрос.ФизЛицо
	|		ГДЕ
	|			ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &ПериодНачало И &ПериодКонец
	|			И ОсновныеНачисленияРаботниковОрганизаций.Организация = &Организация
	|			И ВложенныйЗапрос.Сотрудник > 1
	|			И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.КодДоходаЕСН В(&КодыДохода)
	|			//И ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации = &ПодразделениеОрганизации
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо,
	|			ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
	|			ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник,
	|			ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
	|			ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало,
	|			СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат)
	|		ИЗ
	|			РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
	|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					ВложенныйЗапрос.ФизЛицо КАК ФизЛицо,
	|					КОЛИЧЕСТВО(ВложенныйЗапрос.Сотрудник) КАК Сотрудник
	|				ИЗ
	|					(ВЫБРАТЬ
	|						ВложенныйЗапрос.ФизЛицо КАК ФизЛицо,
	|						ВложенныйЗапрос.Сотрудник КАК Сотрудник
	|					ИЗ
	|						(ВЫБРАТЬ
	|							ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
	|							ОсновныеНачисленияРаботниковОрганизаций.Сотрудник КАК Сотрудник
	|						ИЗ
	|							РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	|						ГДЕ
	|							ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &ПериодНачало И &ПериодКонец
	|							И ОсновныеНачисленияРаботниковОрганизаций.Организация = &Организация
	|						
	|						СГРУППИРОВАТЬ ПО
	|							ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо,
	|							ОсновныеНачисленияРаботниковОрганизаций.Сотрудник
	|						
	|						ОБЪЕДИНИТЬ ВСЕ
	|						
	|						ВЫБРАТЬ
	|							ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
	|							ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник
	|						ИЗ
	|							РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
	|						ГДЕ
	|							ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало МЕЖДУ &ПериодНачало И &ПериодКонец
	|							И ДополнительныеНачисленияРаботниковОрганизаций.Организация = &Организация
	|						
	|						СГРУППИРОВАТЬ ПО
	|							ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
	|							ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник) КАК ВложенныйЗапрос
	|					
	|					СГРУППИРОВАТЬ ПО
	|						ВложенныйЗапрос.ФизЛицо,
	|						ВложенныйЗапрос.Сотрудник) КАК ВложенныйЗапрос
	|				
	|				СГРУППИРОВАТЬ ПО
	|					ВложенныйЗапрос.ФизЛицо) КАК ВложенныйЗапрос
	|				ПО ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо = ВложенныйЗапрос.ФизЛицо
	|		ГДЕ
	|			ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало МЕЖДУ &ПериодНачало И &ПериодКонец
	|			И ДополнительныеНачисленияРаботниковОрганизаций.Организация = &Организация
	|			И ВложенныйЗапрос.Сотрудник > 1
	|			И ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета.КодДоходаЕСН В(&КодыДохода)
	|			//И ДополнительныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации = &ПодразделениеОрганизации
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник,
	|			ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
	|			ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало) КАК ВложенныйЗапрос
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НачалоПериода(ВложенныйЗапрос.ПериодДействия,Месяц),
	|		ВложенныйЗапрос.ФизЛицо,
	|		ВложенныйЗапрос.Сотрудник) КАК ОснДопНач
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
	|			СУММА(ЕСНИсчисленный.ОбязательноеСтрахование) КАК ОбязательноеСтрахование,
	|			СУММА(ЕСНИсчисленный.Доплата) КАК Доплата
	|		ИЗ
	|			РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
	|		ГДЕ
	|			ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &ПериодНачало И &ПериодКонец
	|			И ЕСНИсчисленный.Организация = &Организация
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЕСНИсчисленный.ФизЛицо) КАК ЕСНИсчисленныйРег
	|		ПО ОснДопНач.ФизЛицо = ЕСНИсчисленныйРег.ФизЛицо
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.СрезПоследних(&ПериодКонец, Организация = &Организация) КАК СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевСрезПоследних
	|	ПО (ВЫБОР
	|			КОГДА ОснДопНач.Сотрудник.ВидНалогообложенияОсновной = &ПустойВидНалогообложения
	|				ТОГДА &ОрганизацияОснВидНалогообл
	|			ИНАЧЕ ОснДопНач.Сотрудник.ВидНалогообложенияОсновной
	|		КОНЕЦ = СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевСрезПоследних.ВидНалогообложения)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИноеНалогообложениеПоСотрудникам.СрезПоследних КАК ИноеНалогообложениеПоСотрудникамСрезПоследних
	|			ПО ОснДопНач.Сотрудник = ИноеНалогообложениеПоСотрудникамСрезПоследних.Сотрудник";//О.Т. Аверсон 30.03.2016 № 950
	
	//Ставка = РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(ПериодРегистрации, Новый Структура("Организация",Организация)).Ставка;
	//Запрос1.УстановитьПараметр("СтавкаСтрах",Ставка);
	Запрос1.УстановитьПараметр("ПустойВидНалогообложения",Справочники.ВидыНалогообложения.ПустаяСсылка()); //О.Т. Аверсон 30.03.2016 № 950
	Запрос1.УстановитьПараметр("ОрганизацияОснВидНалогообл",Организация.ОсновнаяСтавкаНалогообложения);//О.Т. Аверсон 30.03.2016 № 950
	Запрос1.УстановитьПараметр("Организация", Организация);
	Запрос1.УстановитьПараметр("ПериодКонец", КонецМесяца(ПериодРегистрации));
	Запрос1.УстановитьПараметр("ПериодНачало", НачалоМесяца(ПериодРегистрации));
	если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
		Запрос1.Текст = СтрЗаменить(Запрос1.Текст,"//И ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации = &ПодразделениеОрганизации","И ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации = &ПодразделениеОрганизации");
		Запрос1.Текст = СтрЗаменить(Запрос1.Текст,"//И ДополнительныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации = &ПодразделениеОрганизации","И ДополнительныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации = &ПодразделениеОрганизации");
	иначе
		Запрос1.Текст = СтрЗаменить(Запрос1.Текст,"//И ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации = &ПодразделениеОрганизации","");
		Запрос1.Текст = СтрЗаменить(Запрос1.Текст,"//И ДополнительныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации = &ПодразделениеОрганизации","");
	КонецЕсли;
	Запрос1.УстановитьПараметр("ПодразделениеОрганизации", ПодразделениеОрганизации);	
	
	КодыДохода = Новый СписокЗначений;
	КодыДохода.Добавить(Справочники.ДоходыЕСН.ОблагаетсяПолностью);
	КодыДохода.Добавить(Справочники.ДоходыЕСН.ОблагаетсяСтрах);
	КодыДохода.Добавить(Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП);
	КодыДохода.Добавить(Справочники.ДоходыЕСН.ОблагаетсяФСЗНиСТРАХ);
	Запрос1.УстановитьПараметр("КодыДохода", КодыДохода);
	РезультатОсновные = Запрос1.Выполнить().Выгрузить();
	//РаботникиОрганизации.Загрузить(Запрос.Выполнить().Выгрузить());
	
	для Каждого стрОсновные из РезультатОсновные Цикл 
		СтрРаботникиОрганизации = РаботникиОрганизации.Добавить();
		ЗаполнитьЗначенияСвойств(СтрРаботникиОрганизации,стрОсновные);
		
		СрЗПРабочихИСлуж = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(ПериодРегистрации)-1,
		Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗП)).размер;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|				И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ВЫБОР
		|					КОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|						ТОГДА НачисленияРаботниковОрганизации.ВидРасчета
		|					ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчетаЗавершения
		|				КОНЕЦ
		|		ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчета
		|	КОНЕЦ КАК ВидРасчета
		|ИЗ
		|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
		|			&парамНачало,
		|			ДокументОснование = ЗНАЧЕНИЕ(Документ.ДоговорНаВыполнениеРаботСФизЛицом.ПустаяСсылка)
		|				И Сотрудник = &Сотрудник) КАК НачисленияРаботниковОрганизации
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|					И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения
		|			ИНАЧЕ НачисленияРаботниковОрганизации.Действие
		|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|	И НачисленияРаботниковОрганизации.Сотрудник = &Сотрудник
		|	И ВЫБОР
		|			КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|					И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА ВЫБОР
		|						КОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|							ТОГДА НачисленияРаботниковОрганизации.ВидРасчета.ВидВремени
		|						ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчетаЗавершения.ВидВремени
		|					КОНЕЦ
		|			ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчета.ВидВремени
		|		КОНЕЦ В (&ВидыВремени)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НачисленияРаботниковОрганизации.ВидРасчета
		|ИЗ
		|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК НачисленияРаботниковОрганизации
		|ГДЕ
		|	НачисленияРаботниковОрганизации.Период > &парамНачало
		|	И НачисленияРаботниковОрганизации.Период <= &парамКонец
		|	И НачисленияРаботниковОрганизации.Организация = &парамГоловнаяОрганизация
		|	И НачисленияРаботниковОрганизации.ДокументОснование = ЗНАЧЕНИЕ(Документ.ДоговорНаВыполнениеРаботСФизЛицом.ПустаяСсылка)
		|	И НачисленияРаботниковОрганизации.ИспользуетсяВНаряде = ЛОЖЬ
		|	И НачисленияРаботниковОрганизации.Сотрудник = &Сотрудник
		|	И ВЫБОР
		|			КОГДА НачисленияРаботниковОрганизации.ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций
		|				ТОГДА ВЫБОР
		|						КОГДА НачисленияРаботниковОрганизации.ВидРасчета.ВидВремени В (&ВидыВремени)
		|							ТОГДА ИСТИНА
		|						ИНАЧЕ ЛОЖЬ
		|					КОНЕЦ
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|			ТОГДА НачисленияРаботниковОрганизации.ВидРасчета
		|		ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчетаЗавершения
		|	КОНЕЦ
		|ИЗ
		|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК НачисленияРаботниковОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК НачисленияРаботниковПроверка
		|		ПО НачисленияРаботниковОрганизации.Сотрудник = НачисленияРаботниковПроверка.Сотрудник
		|			И НачисленияРаботниковОрганизации.ВидРасчетаИзмерение = НачисленияРаботниковПроверка.ВидРасчетаИзмерение
		|			И НачисленияРаботниковОрганизации.ДокументОснование = НачисленияРаботниковПроверка.ДокументОснование
		|			И (НачисленияРаботниковПроверка.Период > НачисленияРаботниковОрганизации.Период)
		|			И (НачисленияРаботниковПроверка.Период <= НачисленияРаботниковОрганизации.ПериодЗавершения)
		|ГДЕ
		|	НачисленияРаботниковОрганизации.ПериодЗавершения >= &парамНачало
		|	И НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамКонец
		|	И НачисленияРаботниковОрганизации.Организация = &парамГоловнаяОрганизация
		|	И НачисленияРаботниковОрганизации.ДокументОснование = ЗНАЧЕНИЕ(Документ.ДоговорНаВыполнениеРаботСФизЛицом.ПустаяСсылка)
		|	И НачисленияРаботниковОрганизации.ИспользуетсяВНаряде = ЛОЖЬ
		|	И НачисленияРаботниковПроверка.Сотрудник ЕСТЬ NULL 
		|	И НачисленияРаботниковОрганизации.Сотрудник = &Сотрудник
		|	И ВЫБОР
		|			КОГДА НачисленияРаботниковОрганизации.ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций
		|				ТОГДА ВЫБОР
		|						КОГДА ВЫБОР
		|								КОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|									ТОГДА НачисленияРаботниковОрганизации.ВидРасчета.ВидВремени
		|								ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчетаЗавершения.ВидВремени
		|							КОНЕЦ В (&ВидыВремени)
		|							ТОГДА ИСТИНА
		|						ИНАЧЕ ЛОЖЬ
		|					КОНЕЦ
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ";
		СписокВидВремени = Новый СписокЗначений;
		СписокВидВремени.Добавить(Перечисления.ВидыВремени.ОтработанноеВПределахНормы);
		СписокВидВремени.Добавить(Перечисления.ВидыВремени.ЧасовоеОтработанноеВПределахНормы);
		Запрос.УстановитьПараметр("ВидыВремени",СписокВидВремени);
		Запрос.УстановитьПараметр("парамГоловнаяОрганизация", Организация);
		Запрос.УстановитьПараметр("парамКонец", КонецМесяца(ПериодРегистрации));
		Запрос.УстановитьПараметр("парамНачало", НачалоМесяца(ПериодРегистрации));
		Запрос.УстановитьПараметр("Сотрудник", стрОсновные.Сотрудник);
		
		РезультатВидРасчета = Запрос.Выполнить().Выбрать();
		Пока РезультатВидРасчета.Следующий() Цикл
			ВидРасчета = РезультатВидРасчета.ВидРасчета;
		КонецЦикла;
		ЗапросДляТабеля = Новый Запрос;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(РабочееВремяРаботниковОрганизаций.Дней) КАК Дней,
		|	РабочееВремяРаботниковОрганизаций.Сотрудник.Физлицо КАК ФизЛицо,
		|	НАЧАЛОПЕРИОДА(РабочееВремяРаботниковОрганизаций.Период, МЕСЯЦ) КАК Период,
		|	СУММА(РабочееВремяРаботниковОрганизаций.Часов) КАК Часов,
		|	РабочееВремяРаботниковОрганизаций.Сотрудник
		|ИЗ
		|	РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
		|ГДЕ
		|	РабочееВремяРаботниковОрганизаций.Сотрудник = &Сотрудник
		|	И РабочееВремяРаботниковОрганизаций.Период МЕЖДУ &Период И &Период1
		|	И РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени В(&ВидИспользованияРабочегоВремени)
		|	И ВЫБОР
		|			КОГДА &ФлагПоТабелю
		|				ТОГДА РабочееВремяРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ТабельУчетаРабочегоВремениОрганизации
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		
		|
		|СГРУППИРОВАТЬ ПО
		|	РабочееВремяРаботниковОрганизаций.Сотрудник.Физлицо,
		|	НАЧАЛОПЕРИОДА(РабочееВремяРаботниковОрганизаций.Период, МЕСЯЦ),
		|	РабочееВремяРаботниковОрганизаций.Сотрудник";
		//Запрос.УстановитьПараметр("Физлицо",ДанныеДляРасчетаЕСН.ФизЛицо);
		//Запрос.УстановитьПараметр("Период1",НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц));
		//Запрос.УстановитьПараметр("Период2",КонецМесяца(ДанныеДляРасчетаЕСН.Месяц)); 
		ТекстПоТабелю = Запрос.Текст;
		Запрос.УстановитьПараметр("Сотрудник", стрОсновные.Сотрудник);
		Запрос.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
		Запрос.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени В(&ВидИспользованияРабочегоВремени)","");
		ЗапросДляТабеля = Новый Запрос;
		УчетнаяПолитикаЗапрос = Новый Запрос; //О.Т. 23.12.2014 № 
		УчетнаяПолитикаЗапрос.Текст = 
		"ВЫБРАТЬ
		|	УчетнаяПолитикаПоПерсоналуОрганизаций.ОтработанноеВремяТолькоПоТабелю
		|ИЗ
		|	РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
		|ГДЕ
		|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация = &Организация";
		УчетнаяПолитикаЗапрос.УстановитьПараметр("Организация",Организация);
		УчетнаяПолитика = УчетнаяПолитикаЗапрос.Выполнить().Выгрузить();
		если УчетнаяПолитика.Количество()>0 Тогда 
			Запрос.УстановитьПараметр("ФлагПоТабелю",УчетнаяПолитика[0].ОтработанноеВремяТолькоПоТабелю);
			ЗапросДляТабеля.УстановитьПараметр("ФлагПоТабелю",УчетнаяПолитика[0].ОтработанноеВремяТолькоПоТабелю);
		иначе
			Запрос.УстановитьПараметр("ФлагПоТабелю",Ложь);
			ЗапросДляТабеля.УстановитьПараметр("ФлагПоТабелю",Ложь);
		КонецЕсли;

		РезТабель = Запрос.Выполнить().Выгрузить();
		
		ЗапросДляТабеля.Текст = ТекстПоТабелю;
		ВидИспользРВ = Новый СписокЗначений;
		ВидИспользРВ.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.Работа);
		// О.Т. 20.11.2014 295
		//ВидИспользРВ.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные);
		//ВидИспользРВ.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.Праздники);
		//ВидИспользРВ.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск);
		//ВидИспользРВ.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ДополнительныйОтпуск); 
		// О.Т. 20.11.2014 295
		ЗапросДляТабеля.УстановитьПараметр("Сотрудник", стрОсновные.Сотрудник);
		ЗапросДляТабеля.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
		ЗапросДляТабеля.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
		ЗапросДляТабеля.УстановитьПараметр("ВидИспользованияРабочегоВремени",ВидИспользРВ);
		РезТабельДля60 = ЗапросДляТабеля.Выполнить().Выгрузить();
		Отбор = Новый Структура();
		Отбор.Вставить("ФизЛицо",стрОсновные.ФизЛицо);
		Отбор.Вставить("Сотрудник",стрОсновные.Сотрудник); //О.Т. 08.08.2014 № 17522
		Отбор.Вставить("Период",НачалоМесяца(ПериодРегистрации));
		ДниТабель = 0;
		ЧасыТабель = 0;
		//РезТабельМассив = РезТабель.НайтиСтроки(Отбор);
		если РезТабель.Количество() > 0 Тогда 
			ДниТабель = РезТабель[0].Дней;
			ЧасыТабель = РезТабель[0].Часов;
		КонецЕсли;

		
		ДниТабельДля60 = 0;
		ЧасыТабельДля60 = 0;
		//РезТабельМассивДля60 = РезТабельДля60.НайтиСтроки(Отбор);
		если РезТабельДля60.Количество() > 0 Тогда 
			ДниТабельДля60 = РезТабельДля60[0].Дней;
			ЧасыТабельДля60 = РезТабельДля60[0].Часов;
		КонецЕсли;


		НормаПоИндивидГрафикуЧасыДля60 = 0;
		НормаПоГрафикуДля60 = 0;
		НормаПоГрафикуЧасыДля60 = 0;
		если не (ДниТабель = 0 или ДниТабель = null) тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Сотрудник,
			|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ВсегоДней,
			|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ВсегоЧасов
			|ИЗ
			|	Документ.ВводИндивидуальныхГрафиковРаботыОрганизации.ГрафикРаботы КАК ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводИндивидуальныхГрафиковРаботыОрганизации КАК ВводИндивидуальныхГрафиковРаботыОрганизации
			|		ПО ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Ссылка = ВводИндивидуальныхГрафиковРаботыОрганизации.Ссылка
			|ГДЕ
			|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Сотрудник = &Сотрудник
			|	И ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Ссылка.ПериодРегистрации МЕЖДУ &ПериодРегистрации1 И &ПериодРегистрации2
			|	И ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Ссылка.Проведен";
			Запрос.УстановитьПараметр("Сотрудник",стрОсновные.Сотрудник);
			Запрос.УстановитьПараметр("ПериодРегистрации1",НачалоМесяца(ПериодРегистрации));
			Запрос.УстановитьПараметр("ПериодРегистрации2",КонецМесяца(ПериодРегистрации));
			Результ = Запрос.Выполнить();
			Результат = Запрос.Выполнить().Выбрать();
			НормаПоИндивидГрафикуЧасы = 0;
			НормаПоГрафику = 0;
			НормаПоИндивидГрафикуЧасыДля60 = 0;
			НормаПоГрафикуДля60 = 0;
			Пока Результат.Следующий() цикл
				НормаПоГрафику = Результат.ВсегоДней;
				если не (ДниТабельДля60 = 0 или ДниТабельДля60 = null) тогда
					НормаПоИндивидГрафикуЧасыДля60 = Результат.ВсегоЧасов;
					НормаПоГрафикуДля60 = Результат.ВсегоДней;
				КонецЕсли;
			КонецЦикла;
			если  НормаПоГрафику = 0 Тогда 
				// Общий график
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы,
				|	СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение) КАК ДополнительноеЗначение,
				|	ГрафикиРаботыПоВидамВремени.Месяц,
				|	СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначениеНорма) КАК ОсновноеЗначениеНорма
				|ИЗ
				|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
				|			РаботникиОрганизацийСрезПоследних.ГрафикРаботы КАК ГрафикРаботы
				|		ИЗ
				|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизацийСрезПоследних
				|		ГДЕ
				|			РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник) КАК ВложенныйЗапрос
				|		ПО ГрафикиРаботыПоВидамВремени.ГрафикРаботы = ВложенныйЗапрос.ГрафикРаботы
				|ГДЕ
				|	ГрафикиРаботыПоВидамВремени.Месяц = &Месяц
				|	И ГрафикиРаботыПоВидамВремени.ВидВремени = &ВидВремени
				|
				|СГРУППИРОВАТЬ ПО
				|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы,
				|	ГрафикиРаботыПоВидамВремени.Месяц";
				Запрос.УстановитьПараметр("Сотрудник",стрОсновные.Сотрудник);
				Запрос.УстановитьПараметр("Период",ПериодРегистрации);
				Запрос.УстановитьПараметр("Месяц",ПериодРегистрации);
				Запрос.УстановитьПараметр("ВидВремени",Справочники.КлассификаторИспользованияРабочегоВремени.РаботаДни);
				
				Рез = Запрос.Выполнить().Выбрать();
				НормаПоГрафику = 0;
				НормаПоГрафикуЧасы = 0;
				НормаПоГрафикуДля60 = 0;
				НормаПоГрафикуЧасыДля60 = 0;
				пока Рез.Следующий() цикл
					НормаПоГрафику =Рез.ОсновноеЗначениеНорма; 
					НормаПоГрафикуЧасы =Рез.ДополнительноеЗначение;
					если не (ДниТабельДля60 = 0 или ДниТабельДля60 = null) тогда
						
						НормаПоГрафикуДля60 = Рез.ОсновноеЗначениеНорма;
					КонецЕсли;
					
					
				КонецЦикла;
				
			КонецЕсли;
		КонецЕсли;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизацийСрезПоследних
		|ГДЕ
		|	РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник
		|	И РаботникиОрганизацийСрезПоследних.Организация = &Организация";
		
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Период", ПериодРегистрации);
		Запрос.УстановитьПараметр("Сотрудник", стрОсновные.Сотрудник);
		
		РезультатСтавка = Запрос.Выполнить().Выбрать();
		ЗанимаемыхСтавок = 0;
		Пока РезультатСтавка.Следующий() Цикл
			ЗанимаемыхСтавок = РезультатСтавка.ЗанимаемыхСтавок;
		КонецЦикла;
		
		
		если ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням Тогда 
			если НормаПоГрафикуДля60 > 0 Тогда 
				МинРазмер60отСрЗП = СрЗПРабочихИСлуж * 0.6 * ДниТабельДля60 / НормаПоГрафикуДля60 * ЗанимаемыхСтавок;

			иначе
				МинРазмер60отСрЗП = 0;
			КонецЕсли;
		иначе
			если НормаПоГрафикуЧасыДля60 > 0 Тогда 

				МинРазмер60отСрЗП = СрЗПРабочихИСлуж * 0.6 * ЧасыТабельДля60 / НормаПоГрафикуЧасыДля60 * ЗанимаемыхСтавок;
			ИначеЕсли НормаПоИндивидГрафикуЧасыДля60 > 0 Тогда 
				
				МинРазмер60отСрЗП = СрЗПРабочихИСлуж * 0.6 * ЧасыТабельДля60 / НормаПоИндивидГрафикуЧасыДля60 * ЗанимаемыхСтавок;
				
			иначе
				МинРазмер60отСрЗП = 0;
			КонецЕсли;
		КонецЕсли;
		Если стрОсновные.Сотрудник.ВидНалогообложенияОсновной = Справочники.ВидыНалогообложения.ПустаяСсылка() Тогда 
			ВидНалогообложения = Организация.ОсновнаяСтавкаНалогообложения;
		иначе
			ВидНалогообложения = стрОсновные.Сотрудник.ВидНалогообложенияОсновной;
		КонецЕсли;
		//О.Т. Аверсон 30.03.2016 № 950
		ЗапросИндСтавкаНалогообл = Новый Запрос;
		ЗапросИндСтавкаНалогообл.Текст = 
		"ВЫБРАТЬ
		|	ИноеНалогообложениеПоСотрудникамСрезПоследних.БГС
		|ИЗ
		|	РегистрСведений.ИноеНалогообложениеПоСотрудникам.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ВидНалогообложения = &ВидНалогообложения
		|				И Сотрудник = &Сотрудник) КАК ИноеНалогообложениеПоСотрудникамСрезПоследних";
		
		ЗапросИндСтавкаНалогообл.УстановитьПараметр("ВидНалогообложения", ВидНалогообложения);
		ЗапросИндСтавкаНалогообл.УстановитьПараметр("Организация", Организация);
		ЗапросИндСтавкаНалогообл.УстановитьПараметр("Период", КонецМесяца(ПериодРегистрации));
		ЗапросИндСтавкаНалогообл.УстановитьПараметр("Сотрудник", стрОсновные.Сотрудник); 
		РезИндСтавкаНалогообл = ЗапросИндСтавкаНалогообл.Выполнить().Выгрузить();
		ЕстьИндивидСтавка = Ложь;
		СтавкаОбязательноеСтрахование = 0;
		Если РезИндСтавкаНалогообл.Количество()>0 Тогда 
			ЕстьИндивидСтавка = Истина;
			СтавкаОбязательноеСтрахование = РезИндСтавкаНалогообл[0].БГС;
		иначе
			СтавкаОбязательноеСтрахование = РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации),Новый Структура("Организация,ВидНалогообложения",Организация,ВидНалогообложения)).Ставка;
		КонецЕсли;
		//О.Т. Аверсон 30.03.2016 № 950
		
		
		//Если ДанныеДляРасчетаЕСН.БазаДоходСтрах + БазаФСЗНПрошлогоМесПроверка < НоваяСтрока.МинРазмер60отСрЗП Тогда
			МинДоплата = МинРазмер60отСрЗП * СтавкаОбязательноеСтрахование/100;
			если МинДоплата > стрОсновные.СуммаБГС Тогда 
				Доплата = МинДоплата - стрОсновные.СуммаБГС; 
			иначе
				Доплата = 0;
				МинРазмер60отСрЗП = 0;	
			КонецЕсли;
		//Иначе
		//	МинРазмер60отСрЗП = 0;
		//	Доплата = 0;
		//КонецЕсли;
		СтрРаботникиОрганизации.Доплата = Доплата;
	КонецЦикла;
	
	
	
	
	//О.Т. 16.12.2014 № 
	Запрос1.Текст = 
	"ВЫБРАТЬ
	|	ОснДопНач.ФизЛицо,
	|	ОснДопНач.ПериодДействия КАК ПериодВзаиморасчетов,
	|	СУММА(ОснДопНач.Результат) КАК СуммаОбл,
	|	СУММА(ЕСНИсчисленныйРег.ОбязательноеСтрахование) КАК СуммаБГСНачисленная,
	|	СУММА(ЕСНИсчисленныйРег.Доплата) КАК ДоплатаНачисленная,
	|	СУММА(ОснДопНач.Результат ) КАК СуммаБГСРасчетная  //* &СтавкаСтрах / 100
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.ФизЛицо КАК ФизЛицо,
	|		НачалоПериода(ВложенныйЗапрос.ПериодДействия,Месяц) КАК ПериодДействия,//О.Т. 11.06.2015 № 
	|		СУММА(ВложенныйЗапрос.Результат) КАК Результат
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ОсновныеНачисленияРаботниковОрганизаций.Сотрудник КАК Сотрудник,
	|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
	|			ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия КАК ПериодДействия,
	|			СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат
	|		ИЗ
	|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					ВложенныйЗапрос.ФизЛицо КАК ФизЛицо,
	|					КОЛИЧЕСТВО(ВложенныйЗапрос.Сотрудник) КАК Сотрудник
	|				ИЗ
	|					(ВЫБРАТЬ
	|						ВложенныйЗапрос.ФизЛицо КАК ФизЛицо,
	|						ВложенныйЗапрос.Сотрудник КАК Сотрудник
	|					ИЗ
	|						(ВЫБРАТЬ
	|							ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
	|							ОсновныеНачисленияРаботниковОрганизаций.Сотрудник КАК Сотрудник
	|						ИЗ
	|							РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	|						ГДЕ
	|							ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &ПериодНачало И &ПериодКонец
	|							И ОсновныеНачисленияРаботниковОрганизаций.Организация = &Организация
	|						
	|						СГРУППИРОВАТЬ ПО
	|							ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо,
	|							ОсновныеНачисленияРаботниковОрганизаций.Сотрудник
	|						
	|						ОБЪЕДИНИТЬ ВСЕ
	|						
	|						ВЫБРАТЬ
	|							ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
	|							ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник
	|						ИЗ
	|							РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
	|						ГДЕ
	|							ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало МЕЖДУ &ПериодНачало И &ПериодКонец
	|							И ДополнительныеНачисленияРаботниковОрганизаций.Организация = &Организация
	|						
	|						СГРУППИРОВАТЬ ПО
	|							ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
	|							ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник) КАК ВложенныйЗапрос
	|					
	|					СГРУППИРОВАТЬ ПО
	|						ВложенныйЗапрос.ФизЛицо,
	|						ВложенныйЗапрос.Сотрудник) КАК ВложенныйЗапрос
	|				
	|				СГРУППИРОВАТЬ ПО
	|					ВложенныйЗапрос.ФизЛицо) КАК ВложенныйЗапрос
	|				ПО ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо = ВложенныйЗапрос.ФизЛицо
	|		ГДЕ
	|			ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &ПериодНачало И &ПериодКонец
	|			И ОсновныеНачисленияРаботниковОрганизаций.Организация = &Организация
	|			И ВложенныйЗапрос.Сотрудник > 1
	|			И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.КодДоходаЕСН В(&КодыДохода)
	|			//И ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации = &ПодразделениеОрганизации
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо,
	|			ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
	|			ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник,
	|			ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
	|			ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало,
	|			СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат)
	|		ИЗ
	|			РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
	|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					ВложенныйЗапрос.ФизЛицо КАК ФизЛицо,
	|					КОЛИЧЕСТВО(ВложенныйЗапрос.Сотрудник) КАК Сотрудник
	|				ИЗ
	|					(ВЫБРАТЬ
	|						ВложенныйЗапрос.ФизЛицо КАК ФизЛицо,
	|						ВложенныйЗапрос.Сотрудник КАК Сотрудник
	|					ИЗ
	|						(ВЫБРАТЬ
	|							ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
	|							ОсновныеНачисленияРаботниковОрганизаций.Сотрудник КАК Сотрудник
	|						ИЗ
	|							РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	|						ГДЕ
	|							ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &ПериодНачало И &ПериодКонец
	|							И ОсновныеНачисленияРаботниковОрганизаций.Организация = &Организация
	|						
	|						СГРУППИРОВАТЬ ПО
	|							ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо,
	|							ОсновныеНачисленияРаботниковОрганизаций.Сотрудник
	|						
	|						ОБЪЕДИНИТЬ ВСЕ
	|						
	|						ВЫБРАТЬ
	|							ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
	|							ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник
	|						ИЗ
	|							РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
	|						ГДЕ
	|							ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало МЕЖДУ &ПериодНачало И &ПериодКонец
	|							И ДополнительныеНачисленияРаботниковОрганизаций.Организация = &Организация
	|						
	|						СГРУППИРОВАТЬ ПО
	|							ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
	|							ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник) КАК ВложенныйЗапрос
	|					
	|					СГРУППИРОВАТЬ ПО
	|						ВложенныйЗапрос.ФизЛицо,
	|						ВложенныйЗапрос.Сотрудник) КАК ВложенныйЗапрос
	|				
	|				СГРУППИРОВАТЬ ПО
	|					ВложенныйЗапрос.ФизЛицо) КАК ВложенныйЗапрос
	|				ПО ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо = ВложенныйЗапрос.ФизЛицо
	|		ГДЕ
	|			ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало МЕЖДУ &ПериодНачало И &ПериодКонец
	|			И ДополнительныеНачисленияРаботниковОрганизаций.Организация = &Организация
	|			И ВложенныйЗапрос.Сотрудник > 1
	|			И ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета.КодДоходаЕСН В(&КодыДохода)
	|			//И ДополнительныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации = &ПодразделениеОрганизации

	|		
	|		СГРУППИРОВАТЬ ПО
	|			ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник,
	|			ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
	|			ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало) КАК ВложенныйЗапрос
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НачалоПериода(ВложенныйЗапрос.ПериодДействия,Месяц),
	|		ВложенныйЗапрос.ФизЛицо) КАК ОснДопНач
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
	|			СУММА(ЕСНИсчисленный.ОбязательноеСтрахование) КАК ОбязательноеСтрахование,
	|			СУММА(ЕСНИсчисленный.Доплата) КАК Доплата
	|		ИЗ
	|			РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
	|		ГДЕ
	|			ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &ПериодНачало И &ПериодКонец
	|			И ЕСНИсчисленный.Организация = &Организация
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЕСНИсчисленный.ФизЛицо) КАК ЕСНИсчисленныйРег
	|		ПО ОснДопНач.ФизЛицо = ЕСНИсчисленныйРег.ФизЛицо
	
	|
	|СГРУППИРОВАТЬ ПО
	|	ОснДопНач.ФизЛицо,
	|	ОснДопНач.ПериодДействия";
	
	если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
		Запрос1.Текст = СтрЗаменить(Запрос1.Текст,"//И ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации = &ПодразделениеОрганизации","И ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации = &ПодразделениеОрганизации");
		Запрос1.Текст = СтрЗаменить(Запрос1.Текст,"//И ДополнительныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации = &ПодразделениеОрганизации","И ДополнительныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации = &ПодразделениеОрганизации");
	иначе
		Запрос1.Текст = СтрЗаменить(Запрос1.Текст,"//И ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации = &ПодразделениеОрганизации","");
		Запрос1.Текст = СтрЗаменить(Запрос1.Текст,"//И ДополнительныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации = &ПодразделениеОрганизации","");
	КонецЕсли;
	Запрос1.УстановитьПараметр("ПодразделениеОрганизации", ПодразделениеОрганизации);	
	
		
	//Ставка = РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(ПериодРегистрации, Новый Структура("Организация",Организация)).Ставка;
	//Запрос1.УстановитьПараметр("СтавкаСтрах",Ставка);  
	РезультатОсновные = Запрос1.Выполнить().Выгрузить();

	Для Каждого стрОсновные из РезультатОсновные Цикл 
		СтрРаботникиОрганизации = РаботникиОрганизацииФизЛица.Добавить();
		ЗаполнитьЗначенияСвойств(СтрРаботникиОрганизации,стрОсновные);
		МассивРаботники = РаботникиОрганизации.НайтиСтроки(Новый Структура("ФизЛицо",стрОсновные.ФизЛицо));
		Сотрудник = Справочники.СотрудникиОрганизаций.ПустаяСсылка();
		Если МассивРаботники.Количество()> 0 Тогда 
			//О.Т. Аверсон 30.03.2016 № 950
			если МассивРаботники[0].Сотрудник.ВидНалогообложенияОсновной = Справочники.ВидыНалогообложения.ПустаяСсылка() Тогда 
				ВидНалогообложения = Организация.ОсновнаяСтавкаНалогообложения;
			Иначе 
				ВидНалогообложения = МассивРаботники[0].Сотрудник.ВидНалогообложенияОсновной;
			КонецЕсли;
			Сотрудник = МассивРаботники[0].Сотрудник;
		иначе
			ВидНалогообложения = Справочники.СотрудникиОрганизаций.НайтиПоНаименованию(стрОсновные.ФизЛицо.Наименование).ВидНалогообложенияОсновной;
			Сотрудник = Справочники.СотрудникиОрганизаций.НайтиПоНаименованию(стрОсновные.ФизЛицо.Наименование);
		КонецЕсли;
		
		//О.Т. Аверсон 30.03.2016 № 950
		ЗапросИндСтавкаНалогообл = Новый Запрос;
		ЗапросИндСтавкаНалогообл.Текст = 
		"ВЫБРАТЬ
		|	ИноеНалогообложениеПоСотрудникамСрезПоследних.БГС
		|ИЗ
		|	РегистрСведений.ИноеНалогообложениеПоСотрудникам.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ВидНалогообложения = &ВидНалогообложения
		|				И Сотрудник = &Сотрудник) КАК ИноеНалогообложениеПоСотрудникамСрезПоследних";
		
		ЗапросИндСтавкаНалогообл.УстановитьПараметр("ВидНалогообложения", ВидНалогообложения);
		ЗапросИндСтавкаНалогообл.УстановитьПараметр("Организация", Организация);
		ЗапросИндСтавкаНалогообл.УстановитьПараметр("Период", ПериодРегистрации);
		ЗапросИндСтавкаНалогообл.УстановитьПараметр("Сотрудник", Сотрудник); 
		РезИндСтавкаНалогообл = ЗапросИндСтавкаНалогообл.Выполнить().Выгрузить();
		ЕстьИндивидСтавка = Ложь;
		Ставка = 0;
		Если РезИндСтавкаНалогообл.Количество()>0 Тогда 
			ЕстьИндивидСтавка = Истина;
			Ставка = РезИндСтавкаНалогообл[0].БГС;
		иначе
			Ставка = РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(ПериодРегистрации, Новый Структура("Организация,ВидНалогообложения",Организация,ВидНалогообложения)).Ставка;//О.Т. Аверсон 30.03.2016 № 950
		КонецЕсли;
		//О.Т. Аверсон 30.03.2016 № 950
		СтрРаботникиОрганизации.СуммаБГСРасчетная = стрОсновные.СуммаБГСРасчетная * Ставка / 100;
		//О.Т. Аверсон 30.03.2016 № 950
		ДанныеИз1ТЧ = РаботникиОрганизации.НайтиСтроки(Новый Структура("ФизЛицо", стрОсновные.ФизЛицо));
		для Каждого стрДанныеИз1ТЧ из ДанныеИз1ТЧ Цикл 
			СтрРаботникиОрганизации.Доплата = СтрРаботникиОрганизации.Доплата + стрДанныеИз1ТЧ.Доплата;
		КонецЦикла;
		СтрРаботникиОрганизации.ДоплатаКНачислению = СтрРаботникиОрганизации.Доплата - стрОсновные.ДоплатаНачисленная;
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЕСНИсчисленный 
	Движения.ЕСНИсчисленный.Записывать = Истина;
	Движения.ЕСНИсчисленный.Очистить();
	Для Каждого ТекСтрокаРаботникиОрганизацииФизЛица Из РаботникиОрганизацииФизЛица Цикл
		если ТекСтрокаРаботникиОрганизацииФизЛица.Доплата <> 0 Тогда 
			Движение = Движения.ЕСНИсчисленный.Добавить();
			Движение.Период = Дата;
			Движение.ФизЛицо = ТекСтрокаРаботникиОрганизацииФизЛица.Физлицо;
			Движение.Организация = Организация;
			Движение.ПериодВзаиморасчетов = ТекСтрокаРаботникиОрганизацииФизЛица.ПериодВзаиморасчетов;
			Движение.Доплата = ТекСтрокаРаботникиОрганизацииФизЛица.Доплата;
			Движение.ОбособленноеПодразделение = Организация;
		КонецЕсли;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
